lNanandol/STM32-freeRTOS-DEV1-IDE/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "queue.h"
#include "portmacro.h"
#include "stm32f411xe.h"
#include "task.h"
#include "SEGGER_SYSVIEW.h"

#include <stdio.h>
#include <string.h>
#include <stdint.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
struct AInfo
{
	uint8_t sizeString;
	uint8_t dataString[255];
};
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */
#define DWT_CTRL (*(volatile uint32_t*)0xE0001000) // DWT_CYCCNT Registro
QueueHandle_t xQueue;
QueueHandle_t xQueueUART;
QueueHandle_t xQueueUARTDMA;
uint8_t g_bufferRX[255];
static const char *msg = NULL;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
void StartDefaultTask(void *argument);

/* USER CODE BEGIN PFP */
static void vTask_LED1(void *pvParams);
static void vTaskMSG_2(void *pvParams);
static void vTaskSendQueue(void *pvParams);
static void vTaskReceiveQueue(void *pvParams);
static void vTaskReceiveQueueUART(void *pvParams);
static void vTaskReceiveQueueUARTDMA(void *pvParams);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
  HAL_UART_Receive_DMA(&huart2, (uint8_t*)g_bufferRX, 255); // Guardar los datos recibidos en un arreglo buffer
  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  // Crear una Queue de 10 elementos de 32 bits
  if((xQueue = xQueueCreate(10, sizeof(uint32_t))) == NULL)
  {
	  msg = "Error durante la creacion de Queue\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }

  // Crear una Queue de 50 elementos de 8 bits
/*  if((xQueueUART = xQueueCreate(50, sizeof(uint8_t))) == NULL)
  {
	  msg = "Error durante la creacion de QueueUART\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }*/

  // Crear una Queue de 5 elementos de 32 bits unsigned
  if((xQueueUARTDMA = xQueueCreate(5, sizeof(struct AInfo *))) == NULL)
  {
	  msg = "Error durante la creacion de QueueUARTDMA\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of defaultTask */
  //defaultTaskHandle = osThreadNew(StartDefaultTask, NULL, &defaultTask_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */

  // Enable Cycle Counter
  DWT_CTRL |= (1<<0);

  SEGGER_SYSVIEW_Conf();
  SEGGER_SYSVIEW_Start();

  // Crear Tarea 1
  if((xTaskCreate(vTask_LED1, "Task LED 1", configMINIMAL_STACK_SIZE, NULL, 1, NULL)) != pdTRUE)
  {
	  msg = "Error durante la creacion de Task 1\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }

  // Crear Tarea 2
  if((xTaskCreate(vTaskMSG_2, "Task MSG 2", configMINIMAL_STACK_SIZE, NULL, 1, NULL)) != pdTRUE)
  {
	  msg = "Error durante la creacion de Task 2\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }

/*  // Crear Tarea SendQueue
  if((xTaskCreate(vTaskSendQueue, "TaskSendQueue", configMINIMAL_STACK_SIZE, NULL, 1, NULL)) != pdTRUE)
  {
	  msg = "Error durante la creacion de vTaskSendQueue\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }

  // Crear Tarea ReceiveQueue
  if((xTaskCreate(vTaskReceiveQueue, "TaskReceiveQueue", configMINIMAL_STACK_SIZE, NULL, 1, NULL)) != pdTRUE)
  {
	  msg = "Error durante la creacion de vTaskReceiveQueue\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }

  // Crear Tarea ReceiveQueueUART
  if((xTaskCreate(vTaskReceiveQueueUART, "TaskReceiveQueueUART", configMINIMAL_STACK_SIZE, NULL, 2, NULL)) != pdTRUE)
  {
	  msg = "Error durante la creacion de vTaskReceiveQueueUART\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }*/

  // Crear Tarea ReceiveQueueUARTDMA
  if((xTaskCreate(vTaskReceiveQueueUARTDMA, "TaskReceiveQueueUARTDMA", configMINIMAL_STACK_SIZE * 2, NULL, 1, NULL)) != pdTRUE)
  {
	  msg = "Error durante la creacion de vTaskReceiveQueueUARTDMA\r\n";
	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 1000);
  }

  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */
  //__HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE);
  __HAL_UART_ENABLE_IT(&huart2, UART_IT_IDLE); // Habilita la interrupcion del puerto serial en idle
  /* USER CODE END USART2_Init 2 */

}

/**
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void)
{

  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Stream5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : B1_Pin */
  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LD2_Pin */
  GPIO_InitStruct.Pin = LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LD2_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
static void vTask_LED1(void *pvParams)
{
  for (;;)
  {
	HAL_GPIO_TogglePin(GPIOA, LD2_Pin);
    vTaskDelay(1000 / portTICK_PERIOD_MS);
  }
  vTaskDelete(NULL);
}

static void vTaskMSG_2(void *pvParams)
{
  for (;;)
  {
    printf("%s\n", (char*)pvParams);
    vTaskDelay(1000 / portTICK_PERIOD_MS);
  }
  vTaskDelete(NULL);
}

static void vTaskSendQueue(void *pvParams)
{
  // Declaracion de variables
  uint32_t counterSend = 0;
  char txBuffer[50];
  int len;

  for (;;)
  {
	counterSend++;
	// Si Queue esta lleno, espera a que se libere espacio
	if((xQueueSend(xQueue, &counterSend, pdMS_TO_TICKS(10))) == pdPASS)
	{
		len = sprintf(txBuffer, "Queue Send, value: %lu\r\n", counterSend);
	}
	else
	{
		len = sprintf(txBuffer, "Queue is full!\r\n");
	}
	//taskENTER_CRITICAL();
	vTaskSuspendAll();
	HAL_UART_Transmit(&huart2, (uint8_t*)txBuffer, len, 1000);
	//taskEXIT_CRITICAL();
	xTaskResumeAll();
    vTaskDelay(100 / portTICK_PERIOD_MS);
  }
  vTaskDelete(NULL);
}

static void vTaskReceiveQueue(void *pvParams)
{
  // Declaracion de variables
  uint32_t counterReceive = 0;
  char txBuffer[50];
  int len;

  for (;;)
  {
	// Espera a que el Queue reciva algun valor
	if((xQueueReceive(xQueue, &counterReceive, pdMS_TO_TICKS(10))) == pdPASS)
	{
		len = sprintf(txBuffer, "Queue Receive, value: %lu\r\n", counterReceive);
		//taskENTER_CRITICAL();
		vTaskSuspendAll();
		HAL_UART_Transmit(&huart2, (uint8_t*)txBuffer, len, 1000);
		//taskEXIT_CRITICAL();
		xTaskResumeAll();
	    //vTaskDelay(1000 / portTICK_PERIOD_MS);
	}
  }
  vTaskDelete(NULL);
}

static void vTaskReceiveQueueUART(void *pvParams)
{
  // Declaracion de variables
  uint8_t txData;

  for (;;)
  {
	// Espera a que el Queue reciva algun valor
	if((xQueueReceive(xQueueUART, &txData, portMAX_DELAY)) == pdPASS)
	{
		//taskENTER_CRITICAL();
		vTaskSuspendAll();
		HAL_UART_Transmit(&huart2, &txData, 1, 1000);
		//taskEXIT_CRITICAL();
		xTaskResumeAll();
	}
    //vTaskDelay(1000 / portTICK_PERIOD_MS);
  }
  vTaskDelete(NULL);
}

static void vTaskReceiveQueueUARTDMA(void *pvParams)
{
  // Declaracion de variables
  struct AInfo  * pxInfoTx;

  for (;;)
  {
	// Espera a que el Queue reciva algun valor
	if((xQueueReceive(xQueueUARTDMA, &pxInfoTx, portMAX_DELAY)) == pdPASS)
	{
		//taskENTER_CRITICAL();
		vTaskSuspendAll();
		HAL_UART_Transmit(&huart2, pxInfoTx->dataString, pxInfoTx->sizeString, 1000);
		//taskEXIT_CRITICAL();
		xTaskResumeAll();
	}
    //vTaskDelay(1000 / portTICK_PERIOD_MS);
  }
  vTaskDelete(NULL);
}

/* Interrupcion UART RX
 * void USART_UserInt(UART_HandleTypeDef* huart)
{
	uint8_t rxChar;
	static portBASE_TYPE xHigherPriorityTaskWoken;

	xHigherPriorityTaskWoken = pdFALSE;

	HAL_UART_Receive(&huart2, &rxChar, 1, 10);

	xQueueSendFromISR(xQueueUART, &rxChar, &xHigherPriorityTaskWoken);

	// Colocar el token al final del ISR
	portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}*/

void USART_UserInt(UART_HandleTypeDef* huart)
{
    // Variable para indicar si se requiere un cambio de contexto
    static portBASE_TYPE xHigherPriorityTaskWoken;

    struct AInfo xInfoRx; // Estructura local para almacenar la trama recibida
    struct AInfo * pxInfoRx = &xInfoRx; // Puntero a la estructura para manipulación
    uint8_t dataLenght;

    xHigherPriorityTaskWoken = pdFALSE; // Inicialmente no hay cambio de contexto

    if(USART2 == huart2.Instance)
    {
        // Detectar si la línea entró en estado IDLE
        if(__HAL_UART_GET_FLAG(&huart2, UART_FLAG_IDLE) != RESET)
        {
            __HAL_UART_CLEAR_IDLEFLAG(&huart2); // Obligatorio: Limpiar bandera para evitar re-entrada

            HAL_UART_DMAStop(&huart2); // Detener DMA para calcular bytes recibidos de forma estática

            // Cálculo de bytes: Tamaño total (255) menos lo que le faltó al DMA por llenar
            dataLenght = 255 - __HAL_DMA_GET_COUNTER(&hdma_usart2_rx);

            if(dataLenght > MAX_STRING_SIZE) dataLenght = MAX_STRING_SIZE;

            xInfoRx.sizeString = dataLenght;
            memcpy(xInfoRx.dataString, g_bufferRX, dataLenght); // Copiar datos del buffer circular del DMA

            // Enviar la estructura por COPIA a la cola (Seguro para variables locales)
            xQueueSendFromISR(xQueueUARTDMA, &xInfoRx, &xHigherPriorityTaskWoken);

            // Reiniciar el DMA para la siguiente trama
            HAL_UART_Receive_DMA(&huart2, (uint8_t*)g_bufferRX, 255);
        }
    }

    // Si xHigherPriorityTaskWoken es pdTRUE, fuerza un cambio de contexto inmediato
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM5 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM5)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
